<a href="https://colab.research.google.com/github/dettystanly7676/Python_Practice_Repo/blob/main/Case_Study_SQL_Questions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Case Study on SQL

In [10]:
import sqlite3
import pandas as pd

In [11]:
def load_imdb_database(db_path):
  try:
    conn = sqlite3.connect(db_path)
    print("IMDB database loaded successfully.")
    return conn
  except sqlite3.Error as e:
    print(f"Error loading IMDB database: {e}")
    return None

In [12]:
db_path = "imdb.db"
conn = load_imdb_database(db_path)

if conn:
  print("Connection successful")
  cursor = conn.cursor()

IMDB database loaded successfully.
Connection successful

## Following is the schema of the IMDB database. It lists all tables and their schemas.

In [13]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

print("Database Schema:")
for table in tables:
    table_name = table[0]
    print(f"\nTable: {table_name}")

    cursor.execute(f"PRAGMA table_info({table_name});")
    schema = cursor.fetchall()

    print("Columns:")
    for column in schema:
        cid, name, dtype, notnull, dflt_value, pk = column
        print(f"  - {name} ({dtype}), NOT NULL: {bool(notnull)}, Default: {dflt_value}, Primary Key: {bool(pk)}")

Database Schema:

Table: Movie
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - title (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - year (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - rating (REAL), NOT NULL: False, Default: None, Primary Key: False
  - num_votes (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Genre
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - GID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Language
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LAID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Country
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - CID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Location
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Location
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LID (REAL), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Country
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - CID (REAL), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Language
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LAID (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Genre
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - GID (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Person
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - Gender (TEXT), NOT NULL: False, Default: None, Primary Key: False

Table: M_Producer
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Director
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Cast
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

In [14]:
# cursor.execute("select *from Person")
# # rows=(cursor.fetchall())
# # for row in rows:
# #   print(row)

# Write SQL queries for the following questions

## 1. Write query to list first 5 rows of Person table

In [16]:
q1 = """select * from Person limit 5"""

In [17]:
def q1_grader(q1):
  result = pd.read_sql_query(q1, conn)
  return result.shape == (5, 4)
  print(result)
print(q1_grader(q1))

True

(0, 'nm0000288', ' Christian Bale', 'Male')
(1, 'nm0000949', ' Cate Blanchett', 'Female')
(2, 'nm1212722', ' Benedict Cumberbatch', 'Male')
(3, 'nm0365140', ' Naomie Harris', 'Female')
(4, 'nm0785227', ' Andy Serkis', 'Male')

## 2. Write query to select title, year and rating from Movie table

In [18]:
q2 = """select title,year,rating from movie"""

In [19]:
def q2_grader(q2):
  result = pd.read_sql_query(q2, conn)
  print(result)
  return result.shape == (3473, 3) and result['title'][0]=='Mowgli'
print(q2_grader(q2))

              title  year  rating
0            Mowgli  2018     6.6
1     Ocean's Eight  2018     6.2
2       Tomb Raider  2018     6.4
3      The Avengers  2012     8.1
4           Tumbbad  2018     8.5
...             ...   ...     ...
3468    Allah-Rakha  1986     6.2
3469          Anari  1993     4.7
3470  Come December  2006     5.7
3471     Kala Jigar  1939     3.3
3472         Kanoon  1994     3.2

[3473 rows x 3 columns]
True

## 3. Write query to get title of first movie in movie table sorted by year in ascending order

In [21]:
q3 = """select title from movie order by year asc limit 1"""

In [22]:
def q3_grader(q3):
  result = pd.read_sql_query(q3, conn)
  print(result)
  return result['title']=='Alam Ara'
print(q3_grader(q3))

      title
0  Alam Ara
0    True
Name: title, dtype: bool

## 4. Write query to get the very first year in which Devdas movie was released

In [23]:
q4 = """select year from movie where title = 'Devdas' order by year asc limit 1"""

In [24]:
def q4_grader(q4):
  result = pd.read_sql_query(q4, conn)
  print(result)
  return result['year']=='1936'
print(q4_grader(q4))

   year
0  1936
0    True
Name: year, dtype: bool

## 5. Write query to get the number of movies released in 2018

In [25]:
q5 = """select count(title) from movie where year=2018"""

In [26]:
def q5_grader(q5):
  result = pd.read_sql_query(q5, conn)
  print(result)
  return result.iloc[0, 0] == 93
print(q5_grader(q5))

   count(title)
0            93
True

## 6. Write query to get the title of the movie with most number of votes in 2012

In [27]:
q6 = """select title from movie where num_votes=(select max(num_votes) from movie where year = 2012)"""

In [28]:
def q6_grader(q6):
  result = pd.read_sql_query(q6, conn)
  print(result)
  return result["title"]=="The Avengers"
print(q6_grader(q6))

          title
0  The Avengers
0    True
Name: title, dtype: bool

## 7. Write SQL query to find all the unique movie titles released in 2018

In [29]:
q7 = """select distinct title from movie where year = 2018"""

In [30]:
def q7_grader(q7):
  result = pd.read_sql_query(q7, conn)
  print(result)
  return result.shape==(93, 1)
print(q7_grader(q7))

                             title
0                           Mowgli
1                    Ocean's Eight
2                      Tomb Raider
3                          Tumbbad
4                        Kedarnath
..                             ...
88              Leera the Soulmate
89  Shaadi Teri Bajayenge Hum Band
90                       Aadamkhor
91           Vaibhav Sethia: Don't
92                Shohrat the Trap

[93 rows x 1 columns]
True

## 8. Write SQL query to get total number of movies released between 2017 (inclusive) and 2018 (inclusive)

In [31]:
q8 = """select count(title) from movie where year between 2017 and 2018"""

In [32]:
def q8_grader(q8):
  result = pd.read_sql_query(q8, conn)
  print(result)
  return result.iloc[0, 0] == 211
print(q8_grader(q8))

   count(title)
0           211
True

## 9. Write SQL query to find the year in which maximum number of movies released

In [37]:
q9 = """select year from movie group by year order by count(title) desc limit 1"""

In [39]:
def q9_grader(q9):
  result = pd.read_sql_query(q9, conn)
  print(result)
  return result["year"][0]=="2005"
print(q9_grader(q9))

   year
0  2005
True

## 10. Write SQL query to find the title of the movie with rating>9.5 and number of votes > 90

In [41]:
q10 = """select title from movie where rating > 9.5 and num_votes > 90"""

In [42]:
def q10_grader(q10):
  result = pd.read_sql_query(q10, conn)
  print(result)
  return result["title"][0]=="Man on Mission Fauladi"
print(q10_grader(q10))

                    title
0  Man on Mission Fauladi
True

## 11. Write SQL query to find the number of movies which has the word 'Dilwale' in their title

In [48]:
q11 = """select count(title) as count_of_Dilwale_Movie from movie where title like '%Dilwale%'"""

In [49]:
def q11_grader(q11):
  result = pd.read_sql_query(q11, conn)
  print(result)
  return result.iloc[0, 0] == 4
print(q11_grader(q11))

   count_of_Dilwale_Movie
0                       4
True

## 12. Write nested SQL query to find the CID of country which produced most number of movies

In [50]:
q12 = """select CID from M_Country group by CID having count(mid) = (select max(movie_count) from (select count(mid) as
Movie_Count from M_Country group by CID))"""

In [51]:
def q12_grader(q12):
  result = pd.read_sql_query(q12, conn)
  print(result)
  return result.iloc[0]==2.0
print(q12_grader(q12))

   CID
0  2.0
CID    True
Name: 0, dtype: bool

## 13. Write nested SQL query to the country which produced most number of movies (use both Courty table and M_Country table)

In [52]:
q13 = """select T1.Name from Country as T1 join M_Country as T2 on T1.CID = T2.CID group by T1.Name order by count(T2.mid)
desc limit 1"""

In [55]:
def q13_grader(q13):
  result = pd.read_sql_query(q13, conn)
  print(result)
  return result.iloc[0, 0] == "India"
print(q13_grader(q13))

    Name
0  India
True

## 14. Write SQL query to get the year and number of movies per year having number of movies per year is greater than 100

In [56]:
q14 = """select year, count(mid) as Movie_Count from Movie group by year having count(mid) > 100 order by year desc"""

In [57]:
def q14_grader(q14):
  result = pd.read_sql_query(q14, conn)
  print(result)
  return result.shape==(13,2)
print(q14_grader(q14))

    year  Movie_Count
0   2017          118
1   2016          118
2   2015          109
3   2014          118
4   2013          127
5   2012          108
6   2011          109
7   2010          117
8   2008          103
9   2007          104
10  2005          128
11  2004          103
12  2003          101
True

## 15. Write SQL query to get the Name and Language ID (LAID) corresponding to Malayalam language

In [66]:
q15 = """select name,laid from language where name = 'Malayalam'"""

In [67]:
def q15_grader(q15):
  result = pd.read_sql_query(q15, conn)
  print(result)
  return result[["Name", "LAID"]].values.tolist() == [['Malayalam', 19]]
print(q15_grader(q15))

        Name  LAID
0  Malayalam    19
True

## 16. Write SQL query to do inner join with movie table and M_Language table with MID colums

In [70]:
q16 = """select * from movie inner join  M_language on movie.MID = M_language.MID limit 10"""

In [74]:
def q16_grader(q16):
  result = pd.read_sql_query(q16, conn)
  return result
# print(q16_grader(q16))

## 17. Write SQL query to list title, year and rating of malayalam movies in the database by doing an inner join with movie table and M_Language table with MID column, also assuming language ID of malayalam movies as 19

In [77]:
q17 = """select title,year,rating from movie inner join M_language on movie.MID = M_language.MID where M_language.LAID = 19"""

In [79]:
def q17_grader(q17):
  result = pd.read_sql_query(q17, conn)
  print(result)
  return result.shape==(16,3)
print(q17_grader(q17))

                            title    year  rating
0                  Dil Hai Betaab    1993     4.6
1                        Chemmeen    1965     7.8
2                           Aryan    1988     7.2
3                       Kala Pani    1996     8.4
4                  Aadupuliyattam    2016     4.2
5                       New Delhi    1987     7.7
6                             Who  I 2018     7.1
7                     Cover Story    2000     5.8
8                        Vaishali    1988     7.7
9                     Maanthrikam    1995     6.3
10                      Abhimanyu    1991     7.1
11               Inspector Balram    1991     6.9
12               Satyameva Jayate    2000     5.3
13           Veettilekkulla Vazhi    2011     6.8
14  Alavuddinum Athbutha Vilakkum    1979     6.8
15                      The Train    2011     4.5
True

In [80]:
![ -f academic.db ] && rm academic.db

conn = sqlite3.connect("academic.db")
cursor = conn.cursor()

## 18. Write SQL query to Create a table named students with two columns id (integer type) and name (varchar type)

In [107]:
q18a = """create table students(
  id integer,
  name text
  )"""

In [106]:
cursor.execute('drop table students')

In [108]:
def q18_grader_a(q18):
  try:
    cursor.execute(q18)
    return True
  except:
    pass

def q18_grader_b(q19):
  result = pd.read_sql_query(q19, conn)
  # print(result)
  return result.columns.tolist() == ['id', 'name']

q18_grader_a(q18a)
q18b = """SELECT * FROM students;"""
result = pd.read_sql_query(q18b, conn)
print(result)

print(q18_grader_a(q18a) and q18_grader_b(q18b))

Empty DataFrame
Columns: [id, name]
Index: []
None

## 19. Write SQL query to insert the values (1, 'Alice') into students table

In [109]:
q19_a = """insert into students values(1, 'Alice')"""

In [111]:
def q19_grader_a(q19_a):
  try:
    cursor.execute(q19_a)
  except:
    pass
  return True

def q19_grader_b(q19_b):
  result = pd.read_sql_query(q19_b, conn)
  return result.values.tolist() == [[1, 'Alice']]

q19_b = "SELECT * FROM students"
result = pd.read_sql_query(q19_b, conn)
print(result)

   id   name
0   1  Alice

In [110]:
print(q19_grader_a(q19_a))

True

In [104]:
print(q19_grader_b(q19_b))

False

## 20. Write SQL Query to add the following more information to students table

| ID | Name    |
|----|---------|
| 2  | Bob     |
| 3  | Charlie |

In [112]:
q20 = """insert into students values(2, 'Bob'),(3, 'Charlie')"""

In [113]:
def q20_grader(q20):
  try:
    cursor.execute(q20)
  except:
    pass
  return True

def q20_grader_b(q20_b):
  result = pd.read_sql_query(q20_b, conn)
  print(result)
  return result.values.tolist() == [[1, 'Alice'], [2, 'Bob'], [3, 'Charlie']]

print(q20_grader(q20) and q20_grader_b(q19_b))

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie
True

In [ ]:
# conn.close()